ConfigFiles/Catalogs/ОбщиеЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОбщиеЗадачи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыОбщихЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапланироватьНеПозднее</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнитьНеПозднее</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбщихЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/InformationRegisters/ВыполнениеОбщихЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВыполнениеОбщихЗадач</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВариантПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПланированияОбщихЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииПроекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СборкаВерсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СборкиВерсии</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТехническийПроект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехническиеПроекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Библиотека</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбщихЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПубликуемыйСрокВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбщаяЗадача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбщиеЗадачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ConfigFiles/Enums/СтатусыОбщихЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыОбщихЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяЗапланировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запланирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Enums/ВариантыПланированияОбщихЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыПланированияОбщихЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Версия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехническийПроект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспользованиеБиблиотеки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Catalogs/ОбщиеЗадачи/Forms/ПланированиеПоПроектам/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщаяЗадача = Параметры.ОбщаяЗадача;
	Раздел = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбщаяЗадача, "Раздел");
	
	ЗаполнитьТаблицуДанными();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ВыбраныСтрокиДляПланирования = Ложь;
	
	МассивСтрокДублей = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		
		НомерСтроки = ТаблицаДанных.Индекс(СтрокаТаблицы) + 1;
		
		Если СтрокаТаблицы.Планировать И НЕ ЗначениеЗаполнено(СтрокаТаблицы.Проект) Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru='В строке %НомерСтроки% не заполнено поле Проект'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", НомерСтроки);
			ПутьКРеквизиту = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТаблицаДанных", НомерСтроки, "Проект");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, ПутьКРеквизиту,, Отказ);
		КонецЕсли;
		
		Если СтрокаТаблицы.Планировать И НЕ ЗначениеЗаполнено(СтрокаТаблицы.Ответственный) Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru='В строке %НомерСтроки% не заполнено поле Ответственный'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", НомерСтроки);
			ПутьКРеквизиту = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТаблицаДанных", НомерСтроки, "Ответственный");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, ПутьКРеквизиту,, Отказ);
		КонецЕсли;
		
		Если СтрокаТаблицы.Планировать Тогда
			ВыбраныСтрокиДляПланирования = Истина;
		КонецЕсли;
		
		Если СтрокаТаблицы.Планировать Тогда
			
			Если МассивСтрокДублей.Найти(СтрокаТаблицы) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Планировать", Истина);
			СтруктураОтбора.Вставить("Проект", СтрокаТаблицы.Проект);
			
			МассивСтрок = ТаблицаДанных.НайтиСтроки(СтруктураОтбора);
			
			Если МассивСтрок.Количество()>1 Тогда
				
				Для Каждого СтрокаДубля Из МассивСтрок Цикл
					МассивСтрокДублей.Добавить(СтрокаДубля);
				КонецЦикла;
				
				Отказ = Истина;
				
				ТекстСообщения = НСтр("ru='Для строки %НомерСтроки%  имеются дубли. Необходимо удалить дублирующие строки'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", НомерСтроки);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ВыбраныСтрокиДляПланирования Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru='Не указано ни одного проекта для планирования задачи'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьВсеОтметки(Команда)
	
	УстановитьОтметки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеОтметки(Команда)
	
	УстановитьОтметки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ОчиститьСообщения();
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьДанныеПланирования();
	
	ТекстОповещения = НСтр("ru='Общая задача запланирована по проектам'");
    ПоказатьОповещениеПользователя(ТекстОповещения, ПолучитьНавигационнуюСсылку(ОбщаяЗадача), ОбщаяЗадача, БиблиотекаКартинок.Информация32);
    ИсторияРаботыПользователя.Добавить(ОбщаяЗадача);
		
	ОповеститьОбИзменении(ОбщаяЗадача);
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ВыполнениеОбщихЗадач"));
	
	Закрыть();
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуДанными()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВыполнениеОбщихЗадачСрезПоследних.Проект КАК Проект,
	|	МАКСИМУМ(ВыполнениеОбщихЗадачСрезПоследних.Ответственный) КАК Ответственный,
	|	ИСТИНА КАК Планировать,
	|	ВыполнениеОбщихЗадачСрезПоследних.Проект.Наименование КАК ПроектНаименование
	|ИЗ
	|	РегистрСведений.ВыполнениеОбщихЗадач.СрезПоследних КАК ВыполнениеОбщихЗадачСрезПоследних
	|ГДЕ
	|	ВыполнениеОбщихЗадачСрезПоследних.ОбщаяЗадача.Раздел = &Раздел
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыполнениеОбщихЗадачСрезПоследних.Проект,
	|	ВыполнениеОбщихЗадачСрезПоследних.Проект.Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПроектНаименование"
	;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Раздел", Раздел);
	
	ДанныеРегистра = Запрос.Выполнить().Выгрузить();
	ТаблицаДанных.Загрузить(ДанныеРегистра);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметки(Отметка)
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		СтрокаТаблицы.Планировать = Отметка;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеПланирования()
	
	ТекущаяДата = ТекущаяДата();
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	ЗапланированныеЗаписи = ЗапланированныеЗадачиПоПроектам();
	
	НаборЗаписей = РегистрыСведений.ВыполнениеОбщихЗадач.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОБщаяЗадача.Установить(ОбщаяЗадача, Истина);
	НаборЗаписей.Отбор.Период.Установить(ТекущаяДата, Истина);
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		
		Если СтрокаТаблицы.Планировать Тогда
			
			СтруктураОтбора = Новый Структура("Проект", Строкатаблицы.Проект);
			
			МассивСтрок = ЗапланированныеЗаписи.НайтиСтроки(СтруктураОтбора);
			
			Если МассивСтрок.Количество()>0 Тогда
				Продолжить;
			КонецЕсли;
			
			Запись = НаборЗаписей.Добавить();
			
			Запись.Период = ТекущаяДата;
			Запись.ОбщаяЗадача = ОбщаяЗадача;
			Запись.Проект = СтрокаТаблицы.Проект;
			Запись.Ответственный = СтрокаТаблицы.Ответственный;
			Запись.СтатусВыполнения = Перечисления.СтатусыОбщихЗадач.ТребуетсяЗапланировать;
			Запись.ВариантПланирования = Перечисления.ВариантыПланированияОбщихЗадач.Версия;
			Запись.Пользователь = ТекущийПользователь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НаборЗаписей.Количество()>0 Тогда
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗапланированныеЗадачиПоПроектам()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВыполнениеОбщихЗадачСрезПоследних.Проект КАК Проект
	|ИЗ
	|	РегистрСведений.ВыполнениеОбщихЗадач.СрезПоследних(, ОбщаяЗадача = &ОбщаяЗадача) КАК ВыполнениеОбщихЗадачСрезПоследних"
	;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ОбщаяЗадача", ОбщаяЗадача);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецфУНКЦИИ

#КонецОбласти
